Script started on Fri 22 Sep 2017 04:50:59 PM EDT
]0;freddy@Freddy-Laptop: ~/Documents/CSC-366/programming_assignments/global_variable_adt[01;32mfreddy@Freddy-Laptop[00m:[01;34m~/Documents/CSC-366/programming_assignments/global_variable_adt[00m$ swipl
Welcome to SWI-Prolog (threaded, 64 bits, version 7.6.0-rc1)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- consult('gv1.pro'[12G[21G)[11G[22G.
[1mtrue.[0m

?- declare(num,0)[11G[18G.
[1mtrue.[0m

?- displayBindings.
num -> 0
[1mtrue.[0m

?- inc(num)[7G[12G.
[1mtrue.[0m

?- valueOf(nu,[Km,Value)[11G[22G.
Value = 1.

?- add(num,5)[7G[14G.
[1mtrue.[0m

?- dec(num)[7G[12G.
[1mtrue.[0m

?- valueOf(num,V)[11G[18G.
V = 5.

?- mul(num,2)[7G[14G.
[1mtrue.[0m

?- sub(num,4)[7G[14G.
[1mtrue.[0m

?- displayBindings.
num -> 6
[1mtrue.[0m

?- dib([K[Kv(num,2)[7G[14G.
[1mtrue.[0m

?- displayBindings.
num -> 3
[1mtrue.[0m

?- undeclare(num)[13G[18G.
[1mtrue.[0m

?- displayBindings.
[1mtrue.[0m

?- halt.
]0;freddy@Freddy-Laptop: ~/Documents/CSC-366/programming_assignments/global_variable_adt[01;32mfreddy@Freddy-Laptop[00m:[01;34m~/Documents/CSC-366/programming_assignments/global_variable_adt[00m$ exit
exit

Script done on Fri 22 Sep 2017 04:52:39 PM EDT
