freddy@Freddy-Laptop:~/Documents/CSC-366/programming_assignments/program_1$ swipl
Welcome to SWI-Prolog (threaded, 64 bits, version 7.6.0-rc1)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- consult('proglang.pro').
true.

?- listing(language).
language(smalltalk).
language(lisp).
language(prolog).
language(snobol).
language(apl).

true.

?- listing(essence).
essence(smalltalk, objects, 'message passing').
essence(lisp, lists, 'recursive functions').
essence(prolog, relations, 'logical inferencing').
essence(snobol, pattern, 'string processing').
essence(apl, matrix, 'matrix operations').

true.

?- listing(history).
:- multifile prolog:history/2.

prolog:history(A, add(B)) :-
	editline:el_add_history(A, B).
prolog:history(A, load(B)) :-
	editline:el_read_history(A, B).
prolog:history(A, save(B)) :-
	editline:el_write_history(A, B).
prolog:history(A, load) :-
    editline:
    (   el_history_events(A, B),
	'$reverse'(B, C),
	forall('$member'(D, C), add_event(D))
    ).

history(smalltalk, inventor('Alan Kay'), date(1980)).
history(lisp, inventor('John McCarthy'), date(1959)).
history(prolog, inventor('Alan Colmeraur'), date(1971)).
history(snobol, inventor('Ralph Griswold (among others)'), date(1962)).
history(apl, inventor('Kenneth Iverson'), date(1964)).

true.

?- halt.
